docs/posts/2018-06-19-family-separation-at-the-borders.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- Jan 07, 2025 -->
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Family Separation at the Borders</title>
<meta name="author" content="Randy Ridenour" />
<meta name="generator" content="Org Mode" />
<link rel='icon' type='image/x-icon' href='/images/favicon.ico'/>
<meta name='viewport' content='width=device-width, initial-scale=1'>
<link rel='stylesheet' href='/css/normalize.css' type='text/css'/>
<link rel='stylesheet' href='/css/main.css' type='text/css'/>
</head>
<body>
<header id="top" class="status">
<div class="banner">
  <h2><a href="/">Randy Ridenour</a></h2>
  <nav class="navbar">
    <ul>
      <li><a href="/">Home</a></li>
      <li><a href="/posts/">Blog</a></li>
      <li><a href="/about.html">About</a></li>
      <li><a href="/tags/">Tags</a></li>
      <li><a href="/rss.xml">RSS</a></li>
    </ul>
  </nav>
</div>
</header>
<main id="content" class="content">
<header>
<h1 class="title">Family Separation at the Borders</h1>
<p class="subtitle" role="doc-subtitle">Jun 19, 2018</p>
</header><p>
I tend to find most political issues to be difficult and intricate, requiring complex and nuanced responses. So, I believe that there is generally room for rational disagreement when evaluating particular policy decisions. This, however, is not the case with the current administration&rsquo;s family separation policy — it is simply heinous, cruel, inhumane, and contrary to the teachings of Jesus. We should not return to the Obama administration&rsquo;s lesser evil of locking up children with their mothers. It is past time for Congress to undertake the difficult task of immigration reform. If God is both just and good, then justice and goodness are not incompatible. We could develop an immigration policy that is both just and good, if we were but willing to do the work. I expressed this today to the offices of my congressional representatives. To find yours, go to [whoismyrepresentative.com](<a href="https://whoismyrepresentative.com/">https://whoismyrepresentative.com/</a>).
</p>



<div class="tagline" id="org69a74e3">
<p>
Tagged: <a href="../tags/politics.html">Politics</a> <a href="../tags/religion.html">Religion</a>
</p>

</div>
</main>
<footer id="postamble" class="status">
<div class='footer'>
  Copyright © 2024 <a href='mailto:rlridenour@fastmail.com'>Randy Ridenour.</a><br>
  Last updated on Jan 07, 2025.<br>
  Generated using <a href="https://www.gnu.org/software/emacs/">Emacs</a> 29.4 (<a href="https://orgmode.org">Org</a> mode 9.8-pre).
</div>
</footer>
</body>
</html>
